<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"b4a7e5029544c0ea47258c5b6acc4225a1da338a42c005879bc8cb6f51f6fd8c","plan_job_ref":"Job .github/workflows/_test-tf.yaml #177 at https://github.com/DND-IT/github-workflows/actions/runs/22462591123","plan_out_hash":"b786ea69e0fa6a6b978540e2cbcec0de2044fe31c8dbc3e5161fa678aa16f18a","plan_hash":"d82d3e6b84524960545846b1fc87ca5fa008e91af1b4e51f3506f7ee3faa7551","plan_text_format":"diff","version":"2.2.3"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #177](https://github.com/DND-IT/github-workflows/actions/runs/22462591123)